---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.GroupAttachedParentName
source: html/ea9d5ef9-5bcc-9a5a-776c-34a035c92697.htm
---
# Autodesk.Revit.DB.ParameterTypeId.GroupAttachedParentName Property

"Attached to"

## Syntax (C#)
```csharp
public static ForgeTypeId GroupAttachedParentName { get; }
```